drop table if exists subject, teacher, timetable;

create table subject
(
	subject_id serial not null,
	name varchar(256) not null,
	primary key(subject_id)
);

CREATE TABLE teacher
(
	teacher_id serial not null,
	full_name varchar(256) not null,
	subject serial not null,
	primary key(teacher_id),
	foreign key(subject) references subject(subject_id)
);

create table timetable
(
	timetable_id serial not null,
	day varchar(128) not null,
	subject serial not null,
	room_numb varchar(128) not null,
	start_time varchar(128) not null,
	week varchar(128) not null,
	primary key(timetable_id),
	foreign key(subject) references subject(subject_id)
);

insert into subject(name) values
  ('<--->'),
  ('Высшая математика (Л)'), ('Игровые виды спорта (Пр)'), ('Иностранный язык (Пр)'),
  ('Введение в информационные технологии (Лаб)'), ('Основы DevOps (Л)'), ('Физика (Пр)'),
  ('Физика (Лаб)'), ('История (Пр)'), ('Математические основы баз данных (Пр)'),
  ('Физика (Л)'), ('Введение в информационные технологии (Пр)'), ('История (Л)'),
  ('Математические основы баз данных (Л)'), ('Высшая математика (Пр)'), ('Математические основы баз данных (Лаб)'),
  ('Проектный практикум (Пр)'), ('Основы DevOps (Лаб)');

insert into teacher(full_name, subject) values
  ('<--->', 1),('Шаймарданова Л. К.', 2),('Королева С. А.', 3),
  ('Воронова Е. В.', 4),('Фурлетов Ю. М.', 5),('Городничев М. Г.', 6),
  ('Бурлаков Е. В.', 7),('Бурлаков Е. В.', 8),('Скляр Л. Н.', 9),
  ('Полищук Ю. В.', 10),('Вальковский С. Н.', 11),('Фурлетов Ю. М.', 12),
  ('Скляр Л. Н.', 13),('Полищук Ю. В.', 14),('Шаймарданова Л. К.', 15),
  ('Изотова А. А.', 16),('Потапченко Т. Д.', 17),('Липатов В. Н.', 18);

insert into timetable(day, subject, room_numb, start_time, week) values
  ('ПОНЕДЕЛЬНИК', 1, '<--->', '1. 09:30 - 11:05', 'четная'),
  ('ПОНЕДЕЛЬНИК', 2, 'в 514(ОП)', '2. 11:20 - 12:55', 'четная'),
  ('ПОНЕДЕЛЬНИК', 3, 'в спортзале(ОП)', '3. 13:10 - 14:45', 'четная'),
  ('ПОНЕДЕЛЬНИК', 4, 'в 404(ОП)', '4. 15:25 - 17:00', 'четная'),
  ('ПОНЕДЕЛЬНИК', 1, '<--->', '5. 17:15 - 18:50', 'четная'),
  ('ВТОРНИК', 1, '<--->', '1. 09:30 - 11:05', 'четная'),
  ('ВТОРНИК', 1, '<--->', '2. 11:20 - 12:55', 'четная'),
  ('ВТОРНИК', 1, '<--->', '3. 13:10 - 14:45', 'четная'),
  ('ВТОРНИК', 1, '<--->', '4. 15:25 - 17:00', 'четная'),
  ('ВТОРНИК', 1, '<--->', '5. 17:15 - 18:50', 'четная'),
  ('СРЕДА', 5, 'в Л-205(А)', '1. 09:30 - 11:05', 'четная'),
  ('СРЕДА', 1, '<--->', '2. 11:20 - 12:55', 'четная'),
  ('СРЕДА', 6, 'в А-414(А)', '3. 13:10 - 14:45', 'четная'),
  ('СРЕДА', 1, '<--->', '4. 15:25 - 17:00', 'четная'),
  ('СРЕДА', 1, '<--->', '5. 17:15 - 18:50', 'четная'),
  ('ЧЕТВЕРГ', 7, 'в 332а(ОП)', '1. 09:30 - 11:05', 'четная'),
  ('ЧЕТВЕРГ', 8, 'в 332а(ОП)', '2. 11:20 - 12:55', 'четная'),
  ('ЧЕТВЕРГ', 9, 'в 318(ОП)', '3. 13:10 - 14:45', 'четная'),
  ('ЧЕТВЕРГ', 10, 'в 404(ОП)', '4. 15:25 - 17:00', 'четная'),
  ('ЧЕТВЕРГ', 1, '<--->', '5. 17:15 - 18:50', 'четная'),
  ('ПЯТНИЦА', 1, '<--->', '1. 09:30 - 11:05', 'четная'),
  ('ПЯТНИЦА', 1, '<--->', '2. 11:20 - 12:55', 'четная'),
  ('ПЯТНИЦА', 3, 'в спортзале(ОП)', '3. 13:10 - 14:45', 'четная'),
  ('ПЯТНИЦА', 9, 'в 318(ОП)', '4. 15:25 - 17:00', 'четная'),
  ('ПЯТНИЦА', 1, '<--->', '5. 17:15 - 18:50', 'четная'),
  ('СУББОТА', 1, '<--->', '1. 09:30 - 11:05', 'четная'),
  ('СУББОТА', 1, '<--->', '2. 11:20 - 12:55', 'четная'),
  ('СУББОТА', 1, '<--->', '3. 13:10 - 14:45', 'четная'),
  ('СУББОТА', 1, '<--->', '4. 15:25 - 17:00', 'четная'),
  ('СУББОТА', 1, '<--->', '5. 17:15 - 18:50', 'четная'),
  ('ПОНЕДЕЛЬНИК', 1, '<--->', '1. 09:30 - 11:05', 'нечетная'),
  ('ПОНЕДЕЛЬНИК', 1, '<--->', '2. 11:20 - 12:55', 'нечетная'),
  ('ПОНЕДЕЛЬНИК', 1, '<--->', '3. 13:10 - 14:45', 'нечетная'),
  ('ПОНЕДЕЛЬНИК', 1, '<--->', '4. 15:25 - 17:00', 'нечетная'),
  ('ПОНЕДЕЛЬНИК', 1, '<--->', '5. 17:15 - 18:50', 'нечетная'),
  ('ВТОРНИК', 4, 'в 405(ОП)', '1. 09:30 - 11:05', 'нечетная'),
  ('ВТОРНИК', 3, 'в спортзале(ОП)', '2. 11:20 - 12:55', 'нечетная'),
  ('ВТОРНИК', 1, '<--->', '3. 13:10 - 14:45', 'нечетная'),
  ('ВТОРНИК', 1, '<--->', '4. 15:25 - 17:00', 'нечетная'),
  ('ВТОРНИК', 1, '<--->', '5. 17:15 - 18:50', 'нечетная'),
  ('СРЕДА', 1, '<--->', '1. 09:30 - 11:05', 'нечетная'),
  ('СРЕДА', 1, '<--->', '2. 11:20 - 12:55', 'нечетная'),
  ('СРЕДА', 2, 'в 514(ОП)', '3. 13:10 - 14:45', 'нечетная'),
  ('СРЕДА', 11, 'в 226(ОП)', '4. 15:25 - 17:00', 'нечетная'),
  ('СРЕДА', 3, 'в спортзале(ОП)', '5. 17:15 - 18:50', 'нечетная'),
  ('ЧЕТВЕРГ', 1, '<--->', '1. 09:30 - 11:05', 'нечетная'),
  ('ЧЕТВЕРГ', 1, '<--->', '2. 11:20 - 12:55', 'нечетная'),
  ('ЧЕТВЕРГ', 12, 'в Л-208(А)', '3. 13:10 - 14:45', 'нечетная'),
  ('ЧЕТВЕРГ', 5, 'в 203(А)', '4. 15:25 - 17:00', 'нечетная'),
  ('ЧЕТВЕРГ', 1, '<--->', '5. 17:15 - 18:50', 'нечетная'),
  ('ПЯТНИЦА', 13, 'в 227(ОП)', '1. 09:30 - 11:05', 'нечетная'),
  ('ПЯТНИЦА', 14, 'в 535(ОП)', '2. 11:20 - 12:55', 'нечетная'),
  ('ПЯТНИЦА', 15, 'в 314(ОП)', '3. 13:10 - 14:45', 'нечетная'),
  ('ПЯТНИЦА', 15, 'в 314(ОП)', '4. 15:25 - 17:00', 'нечетная'),
  ('ПЯТНИЦА', 1, '<--->', '5. 17:15 - 18:50', 'нечетная'),
  ('СУББОТА', 16, 'в А-414(А)', '1. 09:30 - 11:05', 'нечетная'),
  ('СУББОТА', 17, 'в Л-203(А)', '2. 11:20 - 12:55', 'нечетная'),
  ('СУББОТА', 18, 'в ВЦ-302(А)', '3. 13:10 - 14:45', 'нечетная'),
  ('СУББОТА', 18, 'в ВЦ-302(А)', '4. 15:25 - 17:00', 'нечетная'),
  ('СУББОТА', 1, '<--->', '5. 17:15 - 18:50', 'нечетная');